---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralConnectionHandler
source: html/e18d1102-b7d1-8e78-883a-1cd02e3be8a0.htm
---
# StructuralConnectionHandler Properties

Retrieves or changes approval type of the Structural Connection Handler.